examples/artifact_resolve_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <samlp:ArtifactResolve xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol"
                               xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion"
                               xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
                               xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"
                               ID="_f0c06d3728f5da98c417b5add105d3c07cc3c868" Version="2.0"
                               IssueInstant="2021-06-03T10:38:38Z"
                               Destination="http://idp.example.com/resolve_artifact">
            <saml:Issuer>urn:nl-eid-gdi:1.0:DV:00000009999999999001:entities:0000</saml:Issuer>
            <ds:Signature>
                <ds:SignedInfo>
                    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                    <ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
                    <ds:Reference URI="#_f0c06d3728f5da98c417b5add105d3c07cc3c868">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                                <ec:InclusiveNamespaces PrefixList="ds saml samlp xs"/>
                            </ds:Transform>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
                        <ds:DigestValue>...</ds:DigestValue>
                    </ds:Reference>
                </ds:SignedInfo>
                <ds:SignatureValue>...</ds:SignatureValue>
                <ds:KeyInfo>
                    <ds:KeyName>4492219ba557ce9e547a933d15ab87b14a69788d</ds:KeyName>
                </ds:KeyInfo>
            </ds:Signature>
            <samlp:Artifact>AAQAAHZHHN7zNFV4yhPfX5thN0sFe10xr4B3crRVEmPn4m3DE2V GisdfYs</samlp:Artifact>
        </samlp:ArtifactResolve>
    </soapenv:Body>
</soapenv:Envelope>
